package org.example.algorithms.sorting;

/**
 * Пузырьковая сортировка
 * <p>
 * Время работы: O(n^2)<br/>
 * Затраты по памяти: O(1)<br/>
 * Устойчивая: да
 * <p>
 * Использование:<br/>
 * Благодаря своей простоте пузырьковая сортировка идеально подходит для тех, кто только начинает изучать алгоритмы сортировки.
 * Пошаговый процесс поможет новичкам понять саму концепцию сортировки и разобраться в работе этой группы алгоритмов.<br/>
 * На практике не используется.
 * <p>
 * Принцип работы:
 *
 * <p>
 * <a href="https://www.cs.usfca.edu/~galles/visualization/ComparisonSort.html">Визуализация</a>
 */
public class BubbleSort {
}
