package org.example.algorithms.sorting;

/**
 * Пирамидальная сортировка
 * <p>
 * Время работы: O(n log n)<br/>
 * Затраты по памяти: O(1)<br/>
 * Устойчивая: нет
 * <p>
 * Использование:<br/>
 * Пирамидальная сортировка широко используется в задачах, связанных с приоритетными очередями.
 * Так, она есть в алгоритме Дейкстры, сжатии данных, в сетевой маршрутизации и т.д.<br/>
 * Пирамидальная сортировка позволяет эффективно обрабатывать большие объемы данных и экономит память.
 * <p>
 * Принцип работы:
 *
 * <p>
 * <a href="https://www.cs.usfca.edu/~galles/visualization/HeapSort.html">Визуализация</a>
 */
public class HeapSort {
}
