package org.example.algorithms.sorting;

/**
 * Сортировка вставками
 * <p>
 * Время работы: O(n^2)<br/>
 * Затраты по памяти: O(1)<br/>
 * Устойчивая: да
 * <p>
 * Использование:<br/>
 * Особенность сортировки вставками заключается в том, что нам не требуется заранее знать все элементы, которые предстоит отсортировать.
 * Фактически, элементы упорядочиваются по мере их поступления.<br/>
 * Благодаря этому сортировку вставками удобно использовать в случаях, когда элементы поступают в виде потока и их нужно сортировать в реальном времени.
 * Используется в реальных задачах.
 * <p>
 * Принцип работы:
 *
 * <p>
 * <a href="https://www.cs.usfca.edu/~galles/visualization/ComparisonSort.html">Визуализация</a>
 */
public class InsertionSort {
}
