package org.example.algorithms.sorting;

/**
 * Сортировка слиянием
 * <p>
 * Время работы: O(n log n)<br/>
 * Затраты по памяти: O(n)<br/>
 * Устойчивая: да
 * <p>
 * Чем сортировка слиянием лучше быстрой сортировки?<br/>
 * Быстрая сортировка на практике работает быстрее сортировки слиянием.<br/>
 * Особенность сортировки слиянием в том, что данные сначала разделяются, а затем объединяются.
 * Благодаря этому процесс сортировки можно распараллелить так, чтобы данные сортировались разными машинами в кластере.<br/>
 * Это позволяет быстро сортировать огромные объемы данных.
 * <p>
 * <a href="https://www.cs.usfca.edu/~galles/visualization/ComparisonSort.html">Визуализация</a>
 */
public class MergeSort {
}
